In [2]:
import pandas as pd

# === ìƒ˜í”Œ ë°ì´í„° ===
orders = pd.DataFrame({
    'order_id': [1, 2, 3, 4, 5],
    'user_id': [101, 102, 101, 103, 102],
    'city': ['Seoul', 'Busan', 'Seoul', 'Seoul', 'Busan'],
    'amount': [10000, 15000, 20000, 5000, 25000]
})

users = pd.DataFrame({
    'user_id': [101, 102, 103],
    'name': ['ì² ìˆ˜', 'ì˜í¬', 'ë¯¼ìˆ˜'],
    'grade': ['VIP', 'Normal', 'VIP']
})

print("=== orders ===")
print(orders)
print("\n=== users ===")
print(users)

=== orders ===
   order_id  user_id   city  amount
0         1      101  Seoul   10000
1         2      102  Busan   15000
2         3      101  Seoul   20000
3         4      103  Seoul    5000
4         5      102  Busan   25000

=== users ===
   user_id name   grade
0      101   ì² ìˆ˜     VIP
1      102   ì˜í¬  Normal
2      103   ë¯¼ìˆ˜     VIP

### ë„ì‹œ(city)ë³„ ì´ ë§¤ì¶œ êµ¬í•˜ê¸°

In [ ]:
# ë„ì‹œë³„ ì´ë§¤ì¶œì€ ê°„ë‹¨í•˜ê²Œ ê·¸ë£¹ë°”ì´ë¡œ ë¬¶ì–´ì„œ sumì„ ì§„í–‰í•˜ë©´ ë êº¼ê°™ë‹¤.
# ğŸš ì—¬ê¸°ì„œ ì£¼ì˜ì ì€ dfê¼´ë¡œ ë‚˜ì˜¤ê¸° ìœ„í•´ì„œëŠ” ì´ì¤‘ë¦¬ìŠ¤íŠ¸ë¥¼ ì‚¬ìš©í•˜ê±°ë‚˜ as_index=False, reset_index()ë¥¼ í™œìš©í•œë‹¤ëŠ”ê²ƒì´ë‹¤. 
# ğŸš ì´ë–„ â­ï¸ì£¼ì˜ì ì€ ì´ì¤‘ë¦¬ìŠ¤íŠ¸ëŠ” ì¸ë±ìŠ¤ë¡œ ë˜ê¸´í•¨. 

# ğŸš orders['total_salse'] = orders.groupby('city',as_index=False)['amount'].sum() ì˜¤ë¥˜ ì´ìœ  : ê·¸ë£¹ë°”ì´ì—ì„œëŠ” ní–‰ 1ì—´ë¡œ ì¤„ì´ëŠ”ë° ì§€ê¸ˆ ordersì—ì„œ ìƒˆë¡œ ë§Œë“œëŠ” í”¼ì²˜ì˜ í–‰ë ¬í¬ê¸°ì™€ëŠ” ë‹¤ë¥´ë‹¤.
# ğŸš ë”°ë¼ì„œ transformìœ¼ë¡œ ë‹¤ ë“¤ê°€ê²Œ í˜• ë§ì¶”ê±°ë‚˜ ì• ì´ˆì— orders í…Œì´ë¸”ì— ì»¬ëŸ¼ì„ ì¶”ê°€í•˜ëŠ”ê²ƒì´ ì•„ë‹Œ ìƒˆë¡œìš´ í…Œì´ë¸”ì„ ë§Œë“¤ì–´ë„ ëœë‹¤. 
# ğŸš êµ³ì´ transformì„ ì‚¬ìš©í• ë–„ëŠ” ê·¸ë£¹ì— ëŒ€í•œ ì§‘ê³„í•¨ìˆ˜ ê²°ê³¼ë¥¼ ë‹¨ì¼ê°’ê³¼ ë¹„êµí•˜ê¸° ìœ„í•´ì„œ ì‚´ë¦¬ëŠ”ê²ƒì´ë‹¤. 

# orderì— í”¼ì³ ì¶”ê°€í•´ì„œ ë„£ëŠ”ê²ƒ. 
orders['total_salse'] = orders.groupby('city',as_index=False)['amount'].transform('sum') 
print(f"ê¸°ì¡´ì—ì„œ ë§Œë“¤ê¸° :\n {orders}")

# ğŸš ìƒˆë¡œìš´ í…Œì´ë¸” ë§Œë“¤ì–´ì„œ ì‚¬ìš©í•˜ê¸° (ì§€ì—­ë§Œ ë¬¶ê¸°)
orders_total_sales = orders.groupby('city',as_index=False)['amount'].sum()
print(f"\n ìƒˆë¡œìš´ í…Œì´ë¸”ë¡œ ë§Œë“¤ê¸° : \n{orders_total_sales}")

# ğŸš cityê³¼ user_idë¥¼ ë¬¶ê¸° ë¬¶ìŒì´ í•˜ë‚˜ì˜ ì…‹ì´ë¼ì„œ ë˜ ë‹¤ë¥¸ ê²°ê³¼ë¥¼ ë‚³ëŠ”ë‹¤.
orders_total_sales = orders.groupby(['city','user_id'],as_index=False)['amount'].sum()
print(f"\n ìƒˆë¡œìš´ í…Œì´ë¸”ë¡œ ë§Œë“¤ê¸° : \n{orders_total_sales}")

ê¸°ì¡´ì—ì„œ ë§Œë“¤ê¸° :
    order_id  user_id   city  amount  í•´ë‹¹_ìœ ì €ì˜_í‰ê· _ì£¼ë¬¸ì•¡  total_salse
0         1      101  Seoul   10000          30000        35000
1         2      102  Busan   15000          40000        40000
2         3      101  Seoul   20000          30000        35000
3         4      103  Seoul    5000           5000        35000
4         5      102  Busan   25000          40000        40000

 ìƒˆë¡œìš´ í…Œì´ë¸”ë¡œ ë§Œë“¤ê¸° :
    city  amount
0  Busan   40000
1  Seoul   35000

### 1ë²ˆ ê²°ê³¼ë¥¼ DataFrameìœ¼ë¡œ ë§Œë“¤ê³  ì»¬ëŸ¼ëª…ì„ city, totalë¡œ ë³€ê²½

In [ ]:
# ğŸš ì»¬ëŸ¼ëª…ì€ replaceë¡œ ì•ˆë˜ë‚˜? ê·¸ëƒ¥ ìƒˆë¡œ ë§Œë“¤ê³  ë“œëí•´ì•¼í•´? -> No .rename(columns=({})) ì‚¬ìš©  
# ğŸš replaceëŠ” ë‚´ìš©ë¬¼ì„ ë°”ê¾¸ëŠ” í•¨ìˆ˜ renameì€ ì»¬ëŸ¼,í–‰ë ¬ ëª…ì„ ë°”ê¾¸ëŠ”í•¨ìˆ˜. ë”°ë¼ì„œ rows= , columns =ë¥¼ ì •í™•íˆ ëª…ì‹œí•´ì•¼í•œë‹¤. 
# ğŸš  =ì„ ì•ˆí•´ì„œ ì›ë³¸ì— ë°˜ì˜ì„ ì•ˆí•˜ëŠ” ì°¸ì‚¬ê°€ ì¡´ì¬í–ˆë‹¤. 
orders_total_sales = orders_total_sales.rename(columns=({'amount':'total'}))

    city  total
0  Busan  40000
1  Seoul  35000

### ordersì— ìœ ì € ì´ë¦„(name) ë¶™ì´ê¸°

In [ ]:
import pandas as pd 
# ğŸš ì¡°ê±´ì„ í†µí•´ íŠ¹ì •ë§Œ ë¶™ì´ëŠ”ë°©ë²• 
orders_name = pd.merge(orders,users[['user_id','name']],how='left',on='user_id') 
print(orders_name)

# ğŸš ë¬´ì§€ì„± ì¡°ê±´ì—†ì´ ì§¸ë¡œ ë¶™ì´ëŠ” ë°©ë²• .concat() axisë¥¼ í†µí•´ ë¶™ì´ëŠ” ë°©í–¥ ì„¤ì • ì¤‘ìš”
''' orders_total_sales_name = pd.concat([orders_total_sales,users[['name']]],axis=1)
orders_total_sales_name '''

   order_id  user_id   city  amount  total_salse name
0         1      101  Seoul   10000        35000   ì² ìˆ˜
1         2      102  Busan   15000        40000   ì˜í¬
2         3      101  Seoul   20000        35000   ì² ìˆ˜
3         4      103  Seoul    5000        35000   ë¯¼ìˆ˜
4         5      102  Busan   25000        40000   ì˜í¬

" orders_total_sales_name = pd.concat([orders_total_sales,users[['name']]],axis=1)\norders_total_sales_name "

### ìœ ì €(user_id)ë³„ ì´ ì£¼ë¬¸ì•¡ êµ¬í•œ ë’¤, ìœ ì € ì •ë³´(users)ì™€ í•©ì¹˜ê¸°

In [ ]:
# ê·¸ë£¹ë°”ì´ë¥¼ í†µí•´ ìœ ì €ë³„ë¡œ ë¬¶ì€ë‹¤ìŒì— sumì„ ì§„í–‰í•œë‹¤. ìƒˆë¡œìš´ í…Œì´ë¸”ì„ ë§Œë“¤ì–´ì„œ ì§„í–‰.
# ì´í›„ usrsì™€ mergeë¥¼ ì§„í–‰í•˜ëŠ”ë° ì´ê±°ëŠ” user_idë¥¼ ê¸°ì¤€ìœ¼ë¡œ ì „ì²´ í•©ì¹œë‹¤.

# ğŸš ê·¸ëƒ¥ ë‹¨ìˆœ user_idë¡œë§Œ ë¬¶ìœ¼ë‹ˆê¹Œ cityê°€ ë‘ë²ˆì”©ë‚˜ì˜¤ëŠ”ë° ì´ê±°ëŠ” ì™œê·¸ëŸ°ê±°? cityë„ ê·¸ë£¹ìœ¼ë¡œ ë¬¶ì–´ ì¤˜ì•¼í•˜ëŠ”ê±´ê°€? ìë™ìœ¼ë¡œ ì•ˆë¬¶ì´ê³  ? -> ì–´ë–¤ê±¸ ë”í• ì§€ ì•ˆì •í•¨ ã…‹ã…‹ groupby('')ë§Œí–ˆìŒ ['']ì´ê²Œ ì—†ì—ˆë‹¤.
user_group = orders.groupby('user_id',as_index=False)['amount'].sum()
user_group

users_usergroup = pd.merge(users,user_group,how='inner',on='user_id')
users_usergroup

   user_id  amount
0      101   30000
1      102   40000
2      103    5000

### ordersì— "í•´ë‹¹ ìœ ì €ì˜ í‰ê·  ì£¼ë¬¸ì•¡" ì»¬ëŸ¼ ì¶”ê°€

In [3]:
# ordersì— ê·¸ë£¹ë°”ì´ë¥¼ idë¡œ í•˜ê³  ê°ê°ì˜ í‰ê·  ê¸ˆì•¡ì„ ì ì–´í•œë‹¤. ì´ë•Œ ì»¬ëŸ¼ì¶”ê°€ì´ê¸°ì— í”¼ì³ìˆ˜ê°€ ê·¸ë£¹ë°”ì´ ì „ê³¼ ë™ì¼í•´ì•¼í•˜ë©° ì´ëŠ” transformì„ ì´ìš©í•˜ë¼ëŠ”ê²ƒì´ë‹¤.

orders['í•´ë‹¹_ìœ ì €ì˜_í‰ê· _ì£¼ë¬¸ì•¡'] = orders.groupby('user_id',as_index=False)['amount'].transform('mean')
orders

   order_id  user_id   city  amount  í•´ë‹¹_ìœ ì €ì˜_í‰ê· _ì£¼ë¬¸ì•¡
0         1      101  Seoul   10000        15000.0
1         2      102  Busan   15000        20000.0
2         3      101  Seoul   20000        15000.0
3         4      103  Seoul    5000         5000.0
4         5      102  Busan   25000        20000.0

### 5ë²ˆ ê²°ê³¼ë¡œ "í‰ê·  ëŒ€ë¹„ ë¹„ìœ¨" ì»¬ëŸ¼ ì¶”ê°€

In [ ]:
# í‰ê·  ì»¬ëŸ¼ í•˜ë‚˜ ë§Œë“¤ì–´ì„œ í•´ë‹¹_ìœ ì €ì˜_í‰ê· _ì£¼ë¬¸ì•¡ë‘ ë‚˜ëˆ„ê¸° ì‹œì¼œì•¼í•˜ë‚˜

orders['ì´ì£¼ë¬¸ì•¡'] = orders.groupby('user_id',as_index=False)['amount'].transform('sum')
orders['í‰ê· ëŒ€ë¹„_ë¹„ìœ¨'] =  orders['í•´ë‹¹_ìœ ì €ì˜_í‰ê· _ì£¼ë¬¸ì•¡'] / orders['ì´ì£¼ë¬¸ì•¡'] # ğŸš ë³´í†µ í‰ê· ì´ ë’¤ì„. ê°œì¸ / í‰ê·  

orders.sort_values('user_id',ascending=False)

   order_id  user_id   city  amount  í•´ë‹¹_ìœ ì €ì˜_í‰ê· _ì£¼ë¬¸ì•¡   ì´ì£¼ë¬¸ì•¡  í‰ê· ëŒ€ë¹„_ë¹„ìœ¨
3         4      103  Seoul    5000         5000.0   5000      1.0
1         2      102  Busan   15000        20000.0  40000      0.5
4         5      102  Busan   25000        20000.0  40000      0.5
0         1      101  Seoul   10000        15000.0  30000      0.5
2         3      101  Seoul   20000        15000.0  30000      0.5